Config/DataProcessors/HotezaWizard.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>HotezaWizard</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HotelID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InteractionParameters</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/HotezaWizard/Ext/ObjectModule.bsl
#Region Public

// -----------------------------------------------------------------------------
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// -----------------------------------------------------------------------------
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	// NOTHING SO FAR
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
// Run data processor in silent mode
// -----------------------------------------------------------------------------
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	#IF CLIENT THEN
		OpenForm("DataProcessor.HotezaWizard.Form.Form",New Structure("DataProcessor",ThisObject.DataProcessor));
	#ELSE
		If ValueIsFilled(Hotel) And ValueIsFilled(HotelID) And ValueIsFilled(InteractionParameters) Then
			Hoteza.Sync(Hotel, HotelID, InteractionParameters);
		Else
			Raise "Not all data processor parameters are filled!"
		EndIf;
	#ENDIF
EndProcedure // pmRun

#EndRegion
